{
  "vission": "To be a Word Class Training Institution of Reponsitioning Ex Service Men And Woman To Cop With The Challanges of Post Service Life.",
  "mission": "To Consistently Provide Quality Training Geared Towards Preparing Nigerian Armed Forces Personal To Face The Challanges of Re-integrating Into Civil Life.",
  "trainingobjectives": [
    "1. Every trainee irrespective of vocational that are in all time demand in a competitive trade should be able to produce marketable\tmarket. The goods and services should be product/products or render marketable\tproduced with simple tools and machines service/services in his trade and be capable of\tsometimes fashioned and fabricated by the managing his/her own small scale business in\ttrainee himself. The raw materials should be the trade or service.\tlocally sourced. At the end of it all the trainee should be able to set up and run his own",
    "2. Every trainee of agriculture, animal husbandry and other agro based industries should be able to produce products for a competitive market and be able to effectively run his/her own (small scale) business",
    "3. Every trainee that takes the General Management studies should be able to take up a second employment in managerial position and be able to set up and manage successfully his own business",
    "4. Every trainee of Security Practice and Management should be able to provide Industrial/Commercial security for his employer or if trained to managerial grade be able to run, his own, security management service or organization",
    "5. Every trainee of Occupational Therapy Waste to Wealth and Back yard Industries should be able to produce goods and services that are in all time demand in a competitive market. The goods and services should be produced with simple tools and machines sometimes fashioned and fabricated by the trainee himself. The raw materials should be locally sourced. At the end of it all the trainee should be able to set up and run his own business in the trade he has specialized in",
    "6. Every trainee who comes in with army trade certificates in building and other engineering trades should be able to pass his, Ministry of Labour Grade III, Grade ll or Grade I Trade Tests.",
    "7. Every trainee should be able to settle down, live in peace and contribute to the socio economic development of any legitimate community he chooses or in which he finds himself after retirement/discharge."
    
  ],
  "announcement": [
    "<div class='news-box wasa'>New Admin Battalion building commissioned on 13 October 2017</div>",
    "<div class='news-box wasa'>Commissioning of New Infotech Department Wing on 1st December 2017</div>"
    
  ],
  "commandant": {
    "name": "AVM AA JEKENNU",
    "picture": "cmd.jpg",
    "message": "The Commandant Nigerian Armed Forces Resettlement Centre Air Vice Marshal Ajibola Augustine Jekennu, officers, Men and entire staff of the centre Thank you all for your immense contribution to the peace and progress of our father land. As you exit your various services we wish you a fulfilled life in retirement. We wiah you God speed in all your endeavirs. Once agine we wish you all safe journey back to your respective homes.",
    "achievements": [
      "<div class='ach_cmd wasa'>Commisioning Of Admin Battalion</div>",
      "<div class='ach_cmd wasa'>Renovation of NAFRC Guest House</div>",
      "<div class='ach_cmd wasa'>Newly constucted retired army,navy and airforce offices building</div>",
      "<div class='ach_cmd wasa'>Renovation of C company</div>",
      "<div class='ach_cmd wasa'>Renovation of Directors Quarters</div>",
      "<div class='ach_cmd wasa'>Newly constucted Nigerian Armed Forces Resettlement Center Main Gate</div>",
      "<div class='ach_cmd wasa'>Newly constucted Provost Attachment</div>",
      "<div class='ach_cmd wasa'>Commisioning Of Service Men Club NAFRC</div>",
      "<div class='ach_cmd wasa'>And more</div>"
    ]
  },
  "aboutnafrc": "The Nigerian armed forces resettlement center (NAFRC) a prestigious training institution established to reposition and prepare ex-service men and women to cope with challenges of post service life. The focused which is to provide quality training geared towards preparing ex service personnel to face the challenges of reintegrating into the civil life. NAFRC in a bid to enhance proper training and regimentation of soldiers has embarked on serious rehabilitation and provision of social amenities under the assistance of the federal government and the United Nations Department of Labour.This is to make life meaningful for retirees undergoing training at the center. The center is also a reformatory center which ensures smooth transition from military to civilian life for retiring soldiers.After 35 laudable years of service to the nation, military personnel’s from the Nigerian Army, Nigerian Air force and Nigerian Navy are drawn to the center for six months intensive training on skill acquisition and entrepreneurship at the Nigerian Armed Forces Resettlement Center, Oshodi, Lagos.The center was established in the year 1945, and has had over 28 commanders and still counting.<br><br> Air Vice Marshal A.A Jekennu resumed on the 24th, Dec 2016 officially as the commandant of NAFRC with a prodigious vision for the center, making it a favorable environment for both the civilians and military personnel’s to live in as well as working to achieve the centers goal and improving the standard of living. Huge successes has been recorded by the present administration of AVM Jekennu in security challenges, need to be further consolidated and sustained which can only be achieved in an atmosphere of hard work, dedication, trust, respect by both the civilians and military component. The activities of the center have been anchored on the present administration as enunciated in the change mantra. In other words the achievement of the center can be attributed to this mantra. Thus the basics thrust of this article is on the journey so far vis a vis the “change Mantra” which is a key to opening our minds to both challenges and opportunities of continually renovating as well a  re-invigorating the present in a way that will make the future better. <br><br>Additionally it has served as a beacon in which the center used in converting some of our challenges to opportunities. Similarly this has reinforced our commitment by placing our hand firmly on deck to ensure the kind of future that we envision. Furthermore, it is important to state that since the last two years there is no doubt that solid foundation has been laid for the Armed forces towards providing leadership within its area of responsibilities. It is with a sense of duty that the center has tailored its leadership to the port of call to achieve a deserved future. The Centre activities are informed by the imperative of ICT, Administration Logistics, training and civil military relations in realization of the Change Mantra. This mantra provided the connections for a sense of purpose and meaning commensurate with the Defense Headquarters (DHQ) leadership role in accomplishing its task.",
  "nafrcleadership": [
    "<a href='#/leadershipstructure'><div class='news-box wasa'>Leadership Structure</div></a>",
    "<a href='#/pastcommandants'><div class='news-box wasa'>Past Commandants</div></a>",
    "<a href='#/pastdptcommandants'><div class='news-box wasa'>Past Deputy Commandants</div></a>",
    "<a href='#/pastdirectors'><div class='news-box wasa'>Past Directors</div></a>",
    "<a href='#/pastdeputydirectors'><div class='news-box wasa'>Past Deputy Directors</div></a>",
    "<a href='#/pastcommandingofficers'><div class='news-box wasa'>Past Commanding Officers</div></a>"
  ],
  "pastcommandants": [
    {
      "arm": "airfoce",
      "rank": "avm",
      "name": "aa jekenu",
      "start_year": "2015",
      "end_year": "2020"
    }
     
  ],
   "pastdptcommandants": [
    {
      "arm": "N/A",
      "rank": "N/A",
      "name": "N/A",
      "start_year": "N/A",
      "end_year": "N/A"
    }
  ],
  "pastdirectors": [
    {
      "arm": "N/A",
      "rank": "N/A",
      "name": "N/A",
      "department": "N/A",
      "start_year": "N/A",
      "end_year": "N/A"
    }
  ],
  "pastdeputydirectors": [
    {
      "arm": "N/A",
      "rank": "N/A",
      "name": "N/A",
      "department": "N/A",
      "start_year": "N/A",
      "end_year": "N/A"
    }
  ],
  "pastcmdofficers": [
    {
      "arm": "N/A",
      "rank": "N/A",
      "name": "N/A",
      "cmdoffice": "N/A",
      "start_year": "N/A",
      "end_year": "N/A"
    }
  ],
  "wings": [
    "<a href='viewwings?id=0'><div class='news-box wasa'>Agriculture Wing</div></a>",
    "<a href='viewwings?id=1'><div class='news-box wasa'>Auto Mechanic Wing</div></a>",
    "<a href='viewwings?id=2'><div class='news-box wasa'>Buliding And Civil Work Wing</div></a>",
    "<a href='viewwings?id=3'><div class='news-box wasa'>Electrical And Electronic Wing</div></a>",
    "<a href='viewwings?id=4'><div class='news-box wasa'>Fabrication And Welding Wing</div></a>",
    "<a href='viewwings?id=5'><div class='news-box wasa'>Fashion Facilities Wing</div></a>",
    "<a href='viewwings?id=6'><div class='news-box wasa'>Fine Art And Printing Wing</div></a>",
    "<a href='viewwings?id=7'><div class='news-box wasa'>Food And Beverages Wing</div></a>",
    "<a href='viewwings?id=8'><div class='news-box wasa'>Information Technology Wing</div></a>",
    "<a href='viewwings?id=9'><div class='news-box wasa'>Management Courses Wing</div></a>",
    "<a href='viewwings?id=10'><div class='news-box wasa'>Music Department Wing</div></a>",
    "<a href='viewwings?id=11'><div class='news-box wasa'>Soap And Cosmetics Wing</div></a>",
    "<a href='viewwings?id=12'><div class='news-box wasa'>Wooding Works Wing</div></a>"
  ],
  "training": {
    "intro": "The Centre has 35 workshops/departments grouped into 13 wings. Each wing is headed by a Commanding Officer of the rank of a Lt Col or its equivalent while each workshop/department is headed by a Head of Department (HOD). Prior to arriving at NAFRC, trainees are informed about the existing workshops to enable them identify which training best suits their needs.",
    "duration": "NAFRC Training Programme is for a period of 6 months inclusive of one month of industrial attachment programme",
    "entryreq": "Entry qualification for a prospective trainee is GCE/ SSCE/NECO/OND/ACE 1 or equivalent including minimum of 10 years period of Service.",
    "assemblydates": "The assembly dates for trainees are normally the first week of January and July of each year. Nominees are not accepted 14 days after the date of assembly. Accordingly, formations and units are required to inform and duly release the nominees.",
    "methodofit": "Training at the Centre includes lectures, practical classes and industrial attachment in various factories and organizations relevant to trainees field of specialization. All the training in NAFRC is geared towards making the trainees to reintegrate into civil life as smoothly as possible.",
    "reception": "On arrival, trainees are received by a reception team at the main gate and DANJUMA Hall. Reception start by 0800hrs daliy and last for 3 days.",
    "screening": "Trainees are screened on arrival with emphasis on relevant documents and individual health and personal information. Copies of the documents are normally obtained for records and planning by the Directorates, Trainees Battalion and HODs.",
    "wingsinto": "The Centre has 35 workshops /departments grouped into 13 wings. Each wing is commanded by a Lt Col or its equivalent and each department is headed by an HOD. Prior to arriving NAFRC, trainees should review the information contained herein on the departments and identify which training might best meet their needs. The courses are designed to prepare trainees for self employment and an entry level in the job market. The wings are"
  },
  "workshops": [
    {
      "image": "wk_1.jpg",
      "name": "AGRICULTURAL",
      "info": "The trainees in the Agric Wing are taught how to raise a variety of birds, fish, pigs, rabbits, and other animals. They are also trained in crop and egg production, as well as live stock feeds, and maintenance of live stock health"
    },
    {
      "image": "wk_2.jpg",
      "name": "AUTO MECHANIC",
      "info": "The Trainees in the Auto Mechanic Wing are taught the theoretical and practical aspects of repairing vehicles. They are also trained on relevant tools and equipment and skills required to carry repair on different types of vehicles."
    },
    {
      "image": "wk_3.jpg",
      "name": "BULIDING AND CIVIL WORK",
      "info": "The Building Workshop is designed to teach the trainees the construction and maintenance of structures, drawing and reading of building plans and supervision of building projects."
    },
    {
      "image": "wk_4.jpg",
      "name": "ELECTRICAL AND ELECTRONIC",
      "info": "The Electrical Installation Maintenance workshop is designed to teach the trainees basic installation and maintenance of electrical appliances. The Refrigeration and Air Conditioning workshop teaches basic installation and maintenance of household appliances. "
    },
     {
      "image": "wk_5.jpg",
      "name": "FABRICATION AND WELDING",
      "info": "In the Fabrication and welding workshop the trainees are taught the art of fabrication of various machinery and equipment. The topics include reading the rule, conversion of metric decimals and functions, reading the protractor and micrometer."
    },
    {
      "image": "wk_6.jpg",
      "name": "FASHION FACILITIES",
      "info": "The Barbing workshop introduces trainees to basic barbing techniques. Also trainees are taught different barbing styles, tools required and maintenance of tools"
    },
     {
      "image": "wk_7.jpg",
      "name": "FINE ARTS AND PRINTING",
      "info": "The Fine Art and Ceramics workshop is packaged to offer training in graphic arts, textile designs, tie and dye, and ceramics. Trainees are taught general drawing, typefaces and sign writing, screen printing, introduction to tie and dye, introduction to ceramics, moulds, and printing of textile materials. "
    },
     {
      "image": "wk_12.jpg",
      "name": "FOOD AND BEVERAGES",
      "info": "NAFRC sales food and bevverage in the cnetre"
    },
     {
      "image": "wk_x.jpg",
      "name": "MANAGEMENT",
      "info": "The General Management Department introduces the trainees to basic manage¬ment functions and entrepreneurship. The topics include introduction to accounting/ bookkeeping, human relations, marketing and advertising, principles of business, establishing and sustaining small-scale enterprises."
    },
    {
      "image": "wk_8.jpg",
      "name": "INFORMATION TECHNOLOGY",
      "info": "Trainees are introduced to basic computer appreciation, the use of Microsoft Word, Microsoft Access, Excel and other skills such as video editing, network implementation, hardware maintenance and minor repairs."
    },
    {
      "image": "wk_9.jpg",
      "name": "SOAP AND COSMETICS",
      "info": "The aim of this workshop is to assist trainees to acquire a standard practical knowledge of how to produce soap, candles and cosmetics. The topics include identification of materials and machines, locating materials, machines handling of soap reactor with gas burner, preparation of solution, production of soap, candle, body lotion and processing of palm kernel oil."
    },
    {
      "image": "wk_10.jpg",
      "name": "MUSIC DEPARTMENT",
      "info": "Trainees are taught entertaining music using modern musical equipment"
    },
    {
      "image": "wk_11.jpg",
      "name": "WOOD WORK",
      "info": "In the Carpentry and Joinery workshop, the topics include, reading of metrics, use and maintenance of tools, sawing, cutting, making of simple joints, construction of doors, windows tables, and stools. Others are recognition of various timbers and their defects, and composition of manmade boards and their differences."
    }
    
    
  ],
  "events": [
    {
      "image": "ev_1.jpg",
      "info": "Trainee And Officer’s Football Match"
    },
    {
      "image": "ev_2.jpg",
      "info": "The Commandant AVM Augustine Jekennu and Directors in a Group Photograph cutting his Birthday Cake"
    },
    {
      "image": "ev_3.jpg",
      "info": "The Commandant AVM Augustine Jekennu Decorating Captain A.I Lawal with the Rank of Major,assisted by her Spouse Engr. Lawal"
    },
    {
      "image": "ev_4.jpg",
      "info": "The Director of Training decorating an Airforce personnel"
    },
    {
      "image": "ev_5.jpg",
      "info": "Trainee Of Course 2-2017 Group Picture"
    },
    {
      "image": "ev_6.jpg",
      "info": "Inauguration  Trainee Of Course 2-2017"
    },
    {
      "image": "ev_7.jpg",
      "info": "Commandant At Inauguration Of Trainee: Course 2-2017"
    },
    {
      "image": "ev_8.jpg",
      "info": "Coursy Call To The Commandant Group Picture"
    },
    {
      "image": "ev_9.jpg",
      "info": "Youth Empowerment Picture"
    },
    {
      "image": "10.jpg",
      "info": "New Library For Command Children School"
    },
    {
      "image": "11.jpg",
      "info": "Commissioning Of Admin Battalion By Commandant AVM Jekennu 2017"
    },
    {
      "image": "12.jpg",
      "info": "Commissioning Of Admin Battalion By Commandant AVM Jekennu 2017"
    }
    
  ],
  "achievementspics": [
    {
      "image": "acheve_1.jpg",
      "info": "Newly Constructed NAFRC Main Gate"
    },
    {
      "image": "acheve_2.jpg",
      "info": "Renovated library"
    },
    {
      "image": "acheve_3.jpg",
      "info": "Renovated class room"
    },
    {
      "image": "acheve_4.jpg",
      "info": "Supervision of construction of NAFRC resource centre"
    },
    {
      "image": "acheve_5.jpg",
      "info": "Supervision of construction of NAFRC Guest House"
    },
    {
      "image": "acheve_6.jpg",
      "info": "Supervision of construction of NAFRC Guest House"
    },
    {
      "image": "acheve_7.jpg",
      "info": "Supervision of construction of NAFRC Guest House Room"
    },
    {
      "image": "acheve_8.jpg",
      "info": "Newly constructed C company Trainee"
    },
    {
      "image": "acheve_9.jpg",
      "info": "Newly constructed Directors Quarters"
    },
    {
      "image": "acheve_10.jpg",
      "info": "Newly constructed NAFRC Guest House"
    },
    {
      "image": "acheve_11.jpg",
      "info": "Newly constructed Provost Attachment"
    },
    {
      "image": "acheve_12.jpg",
      "info": "Newly constucted retired army,navy and airforce offices building"
    }
  ],
  "contactus": [
    "Address: Charity Bus stop By Papa Ajao Way Oshodi Lagos",
    "Email: NA",
    "Phone Number: NA"
  ]
}